feat (BE+FE): create imm-00 (data asset), update imm-04,05,08 and 09
